tap "aws/tap"
tap "momentohq/tap"
tap "noovolari/brew"
tap "oven-sh/bun"
tap "remotemobprogramming/brew"
tap "speakeasy-api/tap"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Toolchain of the web
brew "biome"
# Library for manipulating PNG images
brew "libpng"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU awk utility
brew "gawk"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Library and utilities for processing GIFs
brew "giflib"
# Open-source GitLab command-line tool
brew "glab"
# GNU implementation of tar
brew "gnu-tar"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Image manipulation library
brew "jpeg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Postgres C API library
brew "libpq", link: true
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# NaCl networking and cryptography library
brew "libsodium"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# Development kit for the Java programming language
brew "openjdk@17", link: true
# Password manager
brew "pass"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# RC file (dotfile) management
brew "rcm"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Cli to interact with Momento services
brew "momentohq/tap/momento-cli"
# Install Leapp CLI
brew "noovolari/brew/leapp-cli-darwin-arm64"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Swift handover for remote mobs using git. mob is a CLI tool written in GO. It keeps your master branch clean and creates WIP commits on mob-session branch.
brew "remotemobprogramming/brew/mob"
# The Speakeasy CLI for interacting with the Speakeasy Platform
brew "speakeasy-api/tap/speakeasy"
# Command-line interface for 1Password
cask "1password-cli"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Cloud credentials manager
cask "leapp"
# Minimal installer for conda
cask "miniconda"
# Control your tools with a few keystrokes
cask "raycast"
vscode "42crunch.vscode-openapi"
vscode "4ops.terraform"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "anthropic.claude-code"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "cameron.vscode-pytest"
vscode "crewsycrews.bundlephobia-support"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "openai.chatgpt"
vscode "pivaszbs.svelte-autoimport"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "stoplight.spectral"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vscjava.migrate-java-to-azure"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-java-upgrade"
vscode "vscjava.vscode-maven"
vscode "vscodevim.vim"
go "golang.org/dl/go1.21.0"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
